In [294]:
import pandas as pd
import numpy as np

In [295]:
authors = pd.DataFrame({'author_id':[1,2,3],
                       'author_name':['Тургенев', 'Чехов', 'Островский']},columns=['author_id', 'author_name'])

In [296]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [297]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],
                       'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 
                                      'Толстый и тонкий', 'Дама с собачкой', 
                                      'Гроза', 'Таланты и поклонники'],
                       'price':[450, 300, 350, 500, 450, 370, 290]},
                       columns=['author_id','book_title','price'])

Задание 2 : Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [298]:
authors_price=pd.merge(authors,book, on='author_id', how='inner')

In [299]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 3 : Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [300]:
top5=authors_price.nlargest(5,'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Задание 4
Создайте датафрейм authors_stat на основе информации из authors_price.
В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price, в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [301]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [303]:
### Создаем DataFrame authors_stat на основе данных из authors_price, при этом избавляемся 
### от повторений наименований автора 
authors_stat = pd.DataFrame({'author_name': np.unique(authors_price['author_name'])},columns=['author_name'])
authors_stat

  author_name
0  Островский
1    Тургенев
2       Чехов

In [304]:
### Уверен, что есть более изящное решение, но я до него догадался.
for a in (np.unique(authors_price['author_name'])):
    all_price_one_author=pd.DataFrame(authors_price.loc[authors_price['author_name']==a,['author_name','price']])
    print('все цены для автора ', a,' : ')
    print(all_price_one_author)
    print()
    authors_stat.loc[(authors_stat['author_name']==a), 'min_price'] = all_price_one_author['price'].min()
    authors_stat.loc[(authors_stat['author_name']==a), 'max_price'] = all_price_one_author['price'].max()
    authors_stat.loc[(authors_stat['author_name']==a), 'mean_price'] = all_price_one_author['price'].mean()

все цены для автора  Островский  :
  author_name  price
5  Островский    370
6  Островский    290

все цены для автора  Тургенев  :
  author_name  price
0    Тургенев    450
1    Тургенев    300
2    Тургенев    350

все цены для автора  Чехов  :
  author_name  price
3       Чехов    500
4       Чехов    450

In [305]:
authors_stat

  author_name  min_price  max_price  mean_price
0  Островский      290.0      370.0  330.000000
1    Тургенев      300.0      450.0  366.666667
2       Чехов      450.0      500.0  475.000000

Задание 5 Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка: ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']. Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака. Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке.Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая",а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями,при необходимости загрузите библиотеку Numpy. Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl".Затем загрузите из этого файла датафрейм и назовите его book_info2.Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

In [317]:
cover_list=['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price['cover']=cover_list
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [371]:
book_info=pd.pivot_table(authors_price,values='price',index='author_name', columns='cover', aggfunc=np.sum, fill_value=0)
book_info

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [375]:
book_info.to_pickle('book_info.pkl')

In [376]:
new_book_info=pd.read_pickle('book_info.pkl')
new_book_info
new_book_info.equals(book_info)

True